Attribute VB_Name = "Module11"
'======================================================================================================================================================
'===============================МОДУЛЬ ОПРЕДЕЛЕНИЯ ЧАСТНЫХ СЛУЖЕБНЫХ ПОДПРОГРАММ ОТПРАВКИ SMS-СООБЩЕНИЙ И СЕРВИСА======================================
'======================================================================================================================================================


'===================================================================КОНСТАНТЫ==========================================================================

Public Const ВерсияКлиента = "1.0.1.0" 'требование использания версии (А.Б.В.Г):  А1.Б1.В1 = А2.Б2.В2,  Г1 = | <> Г2

Public Const КодКлиента = "1"

Public Const СписокМодулей = "Module01,Module02,Module08,Module09,Module11"
Public Const СписокЛистов =  "Приветствие,Список рассылки,SMS рассылка,Журнал рассылки,Сервис,Лог,Настройки"
Public Const СписокФорм =    "ФормаВводаПароля"

'======================================================================================================================================================

'===================================================================ПЕРЕМЕННЫЕ=========================================================================
'======================================================================================================================================================


Sub SMS_рассылка()
    If ПроверкаНаСуществованиеВсехКомпонентовКниги (1) <> "::" Then Exit Sub

    SMS_рассылка_
End Sub


Sub SMS_рассылка_()
    On Error Resume Next
    
    If Not ЧтениеНастроек Then Exit Sub Else If Not ПроверкаГотовности Then Exit Sub
    
    Сообщение = Trim(Sheets("SMS рассылка").Range("f4").value)
    
    If Not (ОбщаяПодготовкаРассылки And ЧастнаяПодготовкаРассылки(Сообщение)) Then Exit Sub
    
    'Отправка SMS
    
    For i = LBound(ТелНомера) To UBound(ТелНомера)
        Ответ = "": Ответ = ОтправитьSMS(Сообщение, ТелНомера(i), ФИОы(i), Примечания(i)): If Ответ <> "ok" Then ЧислоОшибок = ЧислоОшибок + 1
    Next
        
    ЧислоСМС = UBound(ТелНомера) - LBound(ТелНомера) + 1
    
    MsgBox IIf(ЧислоОшибок < ЧислоСМС, "Число успешно отправленных SMS: " & CStr(ЧислоСМС - ЧислоОшибок) & p, "") & _
           IIf(ЧислоОшибок > 0, "Число не отправленных SMS: " & ЧислоОшибок & p, ""), _
           IIf(ЧислоОшибок = 0, vbInformation, IIf(ЧислоОшибок = ЧислоСМС, vbCritical, vbExclamation))
    
    Sheets("Журнал рассылки").Activate
End Sub


Function ЧастнаяПодготовкаРассылки(Сообщение)
    On Error GoTo er
    
    'Проверка входных значений
    
    If Сообщение = "" Then MsgBox "Текст сообщения отсутствует!", vbExclamation: Exit Function
    
    If Not ПроверкаЗапрещенныхВхождений(Сообщение) Then Exit Function
    
    ЧастнаяПодготовкаРассылки = True
    
    Exit Function
er:
    MsgBox "Ошибка частной подготовки рассылки!" & ": " & Err.Source & ": " & Err.Number & ": " & Err.Description, vbCritical
End Function


Function ЧтениеНастроек()
    On Error GoTo er
	
    With Sheets("Настройки") 'чтение настроек
        URL_Root = Trim(.Range("c49").value)
        
        URL_Status = ЧтениеНастройки(.Range("c3").value):   URL_Version = ЧтениеНастройки(.Range("c4").value):  URL_Password = ЧтениеНастройки(.Range("c5").value)
        URL_Balance = ЧтениеНастройки(.Range("c6").value):  URL_SendSMS = ЧтениеНастройки(.Range("c7").value):  URL_StatusSMS = ЧтениеНастройки(.Range("c8").value)
        
        ЗакреплениеРежимаАдминистратора = .Range("a50").value: РежимОтладки = .Range("a51").value
        
        ВключитьМакросы = .Range("a53").value: ВключитьДовериеКОбъектнойМоделиVBA = .Range("a54").value:
    End With
   
    ЧтениеНастроек = True
    
    Exit Function
er:
    MsgBox "Ошибка чтения настроек!" & ": "& Err.Source & ": " & Err.Number & ": " & Err.Description, vbCritical
End Function


Function ЧтениеНастройки(Значение)
    ЧтениеНастройки = Replace(Trim(Значение), "{urlroot}", URL_Root)
End Function






